app/controllers/users_controller.rb

  def index
    @user = current_user
    @book = Book.new
    @user_index = User.all
---
SELECT "users".* FROM "users"

  def show
    @user = User.find(params[:id])
    @book = Book.new
    @books = Book.where(user_id: @user)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 1]]