app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @book = Book.new
    @books = Book.all
---
SELECT "books".* FROM "books"